-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 05, 2026 at 05:30 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `oxfftour_tour`
--

-- --------------------------------------------------------

--
-- Table structure for table `aerox_addmoney`
--

CREATE TABLE `aerox_addmoney` (
  `id` int(11) NOT NULL,
  `Name` varchar(255) DEFAULT NULL,
  `Number` varchar(20) NOT NULL,
  `Method` varchar(50) NOT NULL,
  `Amount` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Payment` varchar(255) NOT NULL,
  `Date` datetime NOT NULL DEFAULT current_timestamp(),
  `Status` enum('Pending','Complete','Failed') DEFAULT 'Pending'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_addmoney`
--

INSERT INTO `aerox_addmoney` (`id`, `Name`, `Number`, `Method`, `Amount`, `Payment`, `Date`, `Status`) VALUES
(49, 'Admin', '01621355971', 'bKash', 5000.00, 'N2407231827365X8KL9', '2025-07-24 05:51:11', 'Complete'),
(50, 'Trail Package', '01719226480', 'bKash', 100.00, 'SCG36FGG', '2025-11-09 23:36:30', 'Complete'),
(51, 'sumonvibot', '01618586841', 'bKash', 100.00, 'CJH6D2D1T8', '2025-11-10 12:39:47', 'Complete'),
(52, 'Shawon', '01912667798', 'bKash', 10.00, 'CKB0413OMQ', '2025-11-11 00:43:18', 'Complete'),
(53, 'MD. ALFI SHAHOR', '01719220456', 'bKash', 50.00, '749EU3JY', '2025-11-12 13:28:58', 'Complete'),
(54, 'MD. ALFI SHAHOR', '01719220456', 'Nagad', 1.00, 'CI141QRFT6', '2025-11-12 13:36:25', 'Complete'),
(55, 'MD. ALFI SHAHOR', '01719220456', 'bKash', 5.00, 'SCG36FGH', '2025-11-13 13:58:07', 'Failed'),
(56, 'Zoro', '01609595636', 'bKash', 500.00, 'CK33TNZPLP', '2025-11-15 01:08:24', 'Complete'),
(58, 'MD. ALFI SHAHOR', '01719220456', 'Nagad', 5000.00, '74HEU83G', '2025-11-20 20:28:36', 'Failed'),
(59, 'MD. ALFI SHAHOR', '01719220456', 'Nagad', 150.00, '74HEU83O', '2025-11-20 20:40:44', 'Failed'),
(60, 'Hdsididj', '01926637019', 'bKash', 150.00, '74HEU83G', '2025-11-20 21:35:21', 'Complete'),
(61, 'Hdsididj', '01926637019', 'Nagad', 150.00, '74HEU83K', '2025-11-21 10:56:17', 'Complete'),
(62, 'Hdsididj', '01926637019', 'Nagad', 1500.00, '74HEU83E', '2025-11-21 10:57:12', 'Complete'),
(63, 'MD. ALFI SHAHOR', '01719220456', 'bKash', 10.00, 'SCG36FCV', '2025-11-21 12:03:43', 'Failed'),
(64, 'MD. ALFI SHAHOR', '01719220456', 'bKash', 450.00, 'CKK4DGTGW0', '2025-11-21 12:12:03', 'Complete'),
(65, 'MD Humayun Ahmed', '01768802953', 'bKash', 6756.00, '567457457', '2025-12-10 16:28:35', 'Complete'),
(66, 'MD Humayun Ahmed', '01768802953', 'bKash', 7567.00, '575675555', '2025-12-10 16:46:46', 'Complete'),
(67, 'MD Humayun Ahmed', '01768802953', 'bKash', 78678.00, '768768', '2025-12-10 22:53:10', 'Complete'),
(68, 'MD Humayun Ahmed', '01768802953', 'bKash', 500.00, 'Gyfyyfyd', '2026-01-05 18:29:52', 'Pending');

-- --------------------------------------------------------

--
-- Table structure for table `aerox_admin`
--

CREATE TABLE `aerox_admin` (
  `id` int(11) NOT NULL,
  `bKash Number` varchar(20) DEFAULT NULL,
  `Nagad Number` varchar(20) DEFAULT NULL,
  `Rocket Number` varchar(20) DEFAULT NULL,
  `Minimum Deposit` decimal(10,2) NOT NULL DEFAULT 50.00,
  `Minimum Withdraw` decimal(10,2) NOT NULL DEFAULT 100.00,
  `Support` varchar(255) DEFAULT NULL,
  `APP LINK` varchar(255) DEFAULT NULL,
  `Payment_Mode` varchar(10) NOT NULL DEFAULT 'Auto',
  `Splash Title` varchar(100) DEFAULT 'Khelo Bangladesh',
  `Splash Logo URL` varchar(255) DEFAULT 'assets/images/app_icon.png'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_admin`
--

INSERT INTO `aerox_admin` (`id`, `bKash Number`, `Nagad Number`, `Rocket Number`, `Minimum Deposit`, `Minimum Withdraw`, `Support`, `APP LINK`, `Payment_Mode`, `Splash Title`, `Splash Logo URL`) VALUES
(1, '01768802953', '01768802953', '01768802953', 20.00, 70.00, 'https://wa.me/881768802953', 'https://play.google.com/store/apps/details?id=your.app.id', 'Manual', 'FF ROCK', 'https://i.ibb.co.com/tTvXvsVK/logo.png');

-- --------------------------------------------------------

--
-- Table structure for table `aerox_freefire`
--

CREATE TABLE `aerox_freefire` (
  `id` int(11) NOT NULL,
  `Match_Key` varchar(255) DEFAULT NULL,
  `Match_Title` varchar(255) DEFAULT NULL,
  `Match_Time` datetime DEFAULT NULL,
  `Total_Prize` decimal(10,2) NOT NULL DEFAULT 0.00,
  `prize_1st` decimal(10,2) NOT NULL DEFAULT 0.00,
  `prize_2nd` decimal(10,2) NOT NULL DEFAULT 0.00,
  `prize_3rd` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Per_Kill` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Entry_Fee` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Entry_Type` varchar(50) DEFAULT NULL,
  `Match_Type` varchar(100) DEFAULT NULL,
  `Version` varchar(50) DEFAULT NULL,
  `Play_Map` varchar(50) DEFAULT NULL,
  `Player_Join` int(11) NOT NULL DEFAULT 0,
  `Player_Need` int(11) NOT NULL DEFAULT 100,
  `Position` varchar(50) DEFAULT 'Match',
  `Room_ID` varchar(100) DEFAULT NULL,
  `Room_Pass` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_freefire`
--

INSERT INTO `aerox_freefire` (`id`, `Match_Key`, `Match_Title`, `Match_Time`, `Total_Prize`, `prize_1st`, `prize_2nd`, `prize_3rd`, `Per_Kill`, `Entry_Fee`, `Entry_Type`, `Match_Type`, `Version`, `Play_Map`, `Player_Join`, `Player_Need`, `Position`, `Room_ID`, `Room_Pass`) VALUES
(69, 'match_69394c0154cdb', 'FF solo Rush', '2025-12-11 18:32:00', 10000.00, 500.00, 300.00, 200.00, 5.00, 50.00, 'Solo', 'BR MATCH', 'TPP', 'Bermuda', 1, 25, 'Result', '6877687576', '8678'),
(70, 'match_693974f2044ef', 'Solo Rush Fight', '2025-12-10 20:25:00', 1000.00, 500.00, 300.00, 200.00, 10.00, 20.00, 'Solo', 'BR MATCH', 'TPP', 'Bermuda', 1, 50, 'Result', 'Hsjshdbd', 'Bxbx'),
(71, 'match_6939751edf77e', '2v2', '2025-12-10 20:26:00', 200.00, 100.00, 60.00, 40.00, 5.00, 20.00, 'Duo', 'BR MATCH', 'TPP', 'Bermuda', 1, 50, 'OnGoing', 'Hsjshdbd', 'Gduddb'),
(72, 'match_69397642ea53f', 'Solo Rush Fight', '2025-12-10 19:40:00', 1000.00, 800.00, 150.00, 5.00, 10.00, 0.00, 'Solo', 'FREE MATCH', 'TPP', 'Bermuda', 1, 100, 'OnGoing', 'Bzjxh', 'Ncnxxn'),
(73, 'match_693978c509d1f', 'Ccc', '2025-12-10 19:44:00', 1000.00, 88.00, 55.00, 855.00, 10.00, 20.00, 'Solo', 'BR MATCH', 'TPP', 'Bermuda', 1, 50, 'Match', 'Cggg', 'Vvvg');

-- --------------------------------------------------------

--
-- Table structure for table `aerox_joining`
--

CREATE TABLE `aerox_joining` (
  `id` int(11) NOT NULL,
  `Match_Key` varchar(255) DEFAULT NULL,
  `Name` varchar(255) DEFAULT NULL,
  `Number` varchar(20) DEFAULT NULL,
  `ingame_name` varchar(255) DEFAULT NULL,
  `team_info` text DEFAULT NULL,
  `winnings` decimal(10,2) NOT NULL DEFAULT 0.00,
  `position` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_joining`
--

INSERT INTO `aerox_joining` (`id`, `Match_Key`, `Name`, `Number`, `ingame_name`, `team_info`, `winnings`, `position`) VALUES
(56, 'match_69394c0154cdb', 'MD Humayun Ahmed', '01768802953', 'rtreste', '[\"rtreste\"]', 200.00, 3),
(57, 'match_6939751edf77e', 'MD Humayun Ahmed', '01768802953', 'Hunayun', '[\"Hunayun\",\"Rakib\"]', 0.00, NULL),
(58, 'match_693974f2044ef', 'MD Humayun Ahmed', '01768802953', 'B', '[\"B\"]', 500.00, 1),
(59, 'match_69397642ea53f', 'MD Humayun Ahmed', '01768802953', 'Bbh', '[\"Bbh\"]', 0.00, NULL),
(60, 'match_693978c509d1f', 'MD Humayun Ahmed', '01768802953', 'Ccc', '[\"Ccc\"]', 0.00, NULL),
(61, 'match_695b8d4cd20f5', 'MD Humayun Ahmed', '01768802953', 'Ggg', '[\"Ggg\"]', 0.00, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `aerox_ludo`
--

CREATE TABLE `aerox_ludo` (
  `id` int(11) NOT NULL,
  `Match_Key` varchar(255) DEFAULT NULL,
  `Match_Title` varchar(255) DEFAULT NULL,
  `Match_Time` datetime DEFAULT NULL,
  `Total_Prize` decimal(10,2) NOT NULL DEFAULT 0.00,
  `prize_1st` decimal(10,2) NOT NULL DEFAULT 0.00,
  `prize_2nd` decimal(10,2) NOT NULL DEFAULT 0.00,
  `prize_3rd` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Per_Kill` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Entry_Fee` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Entry_Type` varchar(50) DEFAULT 'Ludo',
  `Match_Type` varchar(100) DEFAULT NULL,
  `Version` varchar(50) DEFAULT 'Mobile',
  `Play_Map` varchar(50) DEFAULT 'Ludo',
  `Player_Join` int(11) NOT NULL DEFAULT 0,
  `Player_Need` int(11) NOT NULL DEFAULT 2,
  `Position` varchar(50) DEFAULT 'Match',
  `Room_ID` varchar(100) DEFAULT NULL,
  `Room_Pass` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `aerox_notice`
--

CREATE TABLE `aerox_notice` (
  `id` int(11) NOT NULL,
  `Notice` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_notice`
--

INSERT INTO `aerox_notice` (`id`, `Notice`, `created_at`, `updated_at`) VALUES
(1, 'আপনি একজন esports প্লেয়ার? গেম খেলে আপনি প্রতিদিন জিতে নিতে পারেন ১০০০-২০০০ টাকা পর্যন্ত রিওয়ার্ড। আমাদের ম্যাচগুলো পেইজে লাইভ করা হয় এবং যেকোন সমস্যায় টেলিগ্রামে মেসেজ করুন ❤️', '2025-07-02 09:12:12', '2025-07-11 08:29:14');

-- --------------------------------------------------------

--
-- Table structure for table `aerox_password`
--

CREATE TABLE `aerox_password` (
  `id` int(11) NOT NULL,
  `username` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_password`
--

INSERT INTO `aerox_password` (`id`, `username`, `password`) VALUES
(1, 'admin', '$2y$10$GoG8WqaKSsEJUTg4gRyQ7.GKsmFSe6R9NlLc47OJ68/b2EQMVLRrW');

-- --------------------------------------------------------

--
-- Table structure for table `aerox_pubg`
--

CREATE TABLE `aerox_pubg` (
  `id` int(11) NOT NULL,
  `Match_Title` varchar(255) NOT NULL,
  `Match_Key` varchar(100) NOT NULL,
  `Play_Map` varchar(50) DEFAULT 'Erangel',
  `Version` varchar(50) DEFAULT 'TPP',
  `Entry_Type` varchar(50) DEFAULT 'Solo',
  `Entry_Fee` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Match_Type` varchar(100) DEFAULT 'Classic',
  `Per_Kill` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Total_Prize` decimal(10,2) NOT NULL DEFAULT 0.00,
  `prize_1st` decimal(10,2) NOT NULL DEFAULT 0.00,
  `prize_2nd` decimal(10,2) NOT NULL DEFAULT 0.00,
  `prize_3rd` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Player_Need` int(11) NOT NULL DEFAULT 100,
  `Player_Join` int(11) NOT NULL DEFAULT 0,
  `Match_Time` varchar(100) NOT NULL,
  `Room_ID` varchar(100) DEFAULT NULL,
  `Room_Pass` varchar(100) DEFAULT NULL,
  `Position` enum('Match','OnGoing','Result') DEFAULT 'Match',
  `Status` int(11) DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_pubg`
--

INSERT INTO `aerox_pubg` (`id`, `Match_Title`, `Match_Key`, `Play_Map`, `Version`, `Entry_Type`, `Entry_Fee`, `Match_Type`, `Per_Kill`, `Total_Prize`, `prize_1st`, `prize_2nd`, `prize_3rd`, `Player_Need`, `Player_Join`, `Match_Time`, `Room_ID`, `Room_Pass`, `Position`, `Status`, `created_at`) VALUES
(1, 'FF solo Rush', 'match_695b8d4cd20f5', 'Miramar', 'TPP', 'Solo', 657.00, 'Classic', 657.00, 65.00, 657.00, 567.00, 7656.00, 100, 1, '2026-01-16 19:08:00', NULL, NULL, 'Match', 1, '2026-01-05 10:07:08'),
(2, 'FF solo Rush', 'match_695b9d37b0589', 'Erangel', 'TPP', 'Squad', 10.00, 'Classic', 2.00, 100.00, 50.00, 30.00, 20.00, 100, 0, '2026-01-06 20:17:00', '6877687576', '1234567', 'Match', 1, '2026-01-05 11:15:03');

-- --------------------------------------------------------

--
-- Table structure for table `aerox_pubg_joining`
--

CREATE TABLE `aerox_pubg_joining` (
  `id` int(11) NOT NULL,
  `Match_Key` varchar(100) NOT NULL,
  `User_Number` varchar(20) NOT NULL,
  `PUBG_ID_Name` varchar(255) NOT NULL,
  `Join_Time` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `aerox_results`
--

CREATE TABLE `aerox_results` (
  `id` int(11) NOT NULL,
  `match_key` varchar(255) NOT NULL,
  `position` int(11) NOT NULL,
  `player_name` varchar(255) NOT NULL,
  `winnings` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `aerox_rules`
--

CREATE TABLE `aerox_rules` (
  `id` int(11) NOT NULL,
  `match_category` varchar(100) NOT NULL,
  `rules_text` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_rules`
--

INSERT INTO `aerox_rules` (`id`, `match_category`, `rules_text`) VALUES
(1, 'BR MATCH', '⭕ ম্যাচ শুরুর আগ থেকেই ভিডিও চালু রাখতে হবে।\r\n⭕ ম্যাচে গাড়ি বা ট্রাক চালানো যাবে না। গাড়ি চালালে সেই ম্যাচের টাকা বাতিল হবে।\r\n⭕ দুই ম্যাচে গাড়ি ব্যবহার করলে অ্যাপ থেকে স্থায়ী ব্যান করা হবে।\r\n⭕ স্কোয়াড ম্যাচে Sniper Gun ব্যবহার করা যাবে।\r\n⭕ সলো ম্যাচে Sniper Gun ব্যবহার করা যাবে না।\r\n⭕ স্নাইপার ব্যাগে উঠলে সাথে সাথে ফেলে দিতে হবে।\r\n⭕ স্নাইপার দিয়ে কিল করলে কিলকৃত শত্রু ১ কিলের টাকা পাবে।\r\n⭕ Victor Gun ব্যবহার করা যাবে না।\r\n⭕ Victor Gun ব্যাগে উঠলে সাথে সাথে ফেলে দিতে হবে।\r\n⭕ Victor দিয়ে কিল করলে কিলকৃত শত্রু ১ কিলের টাকা পাবে।\r\n⭕ রুম আইডি ও পাসওয়ার্ড কোন UN-REGISTERED প্লেয়ারের সাথে শেয়ার করা যাবে না।\r\n⭕ কোনো PC প্লেয়ার গ্রহণযোগ্য নয়।\r\n⭕ নেটওয়ার্ক/সার্ভার সমস্যায় ম্যাচে ঢুকতে না পারলে কোনো রিফান্ড নেই।\r\n⭕ রুম আইডি এবং পাসওয়ার্ড ম্যাচের ২৪ মিনিট আগে দেওয়া হবে।\r\n⭕ সময়মতো রুমে জয়েন করতে না পারলে রিফান্ড দেওয়া হবে না।\r\n⭕ রুম ফুল দেখালে অবশ্যই Observer-এ গিয়ে স্ক্রিনশট/ভিডিও নিতে হবে; না দিলে রিফান্ড নেই।\r\n⭕ Free Fire আইডির লেভেল ৫৫ এর কম হলে খেলতে পারবেন না।\r\n⭕ কম লেভেলের আইডি দিয়ে জয়েন করলে কিক হলেও রিফান্ড নেই।\r\n⭕ কোনো Hack / FF Tools / Cheat ব্যবহার করা যাবে না।\r\n⭕ টিমিং করলে বা হ্যাক প্রমাণিত হলে বিনা নোটিশে ব্যান করা হবে।\r\n⭕ কাস্টমে ঢোকার আগে প্লেয়ার ৪৮ জন থাকলে এবং ফুল দেখালে সঙ্গে সঙ্গে Expectator এ গিয়ে স্ক্রিনশট নিতে হবে।\r\n⭕ স্ক্রিনশট না দিলে রিফান্ড দেওয়া হবে না।\r\n⭕ কাস্টম আইডি নেওয়া থেকে ম্যাচ শুরু হওয়া পর্যন্ত ভিডিও করতে হবে।\r\n⭕ ম্যাচ সমস্যা থাকলে ম্যাচ শেষের ২০–৩০ মিনিটের মধ্যে জানাতে হবে; পরে জানালে গ্রহণযোগ্য নয়।\r\n⭕ ম্যাচের টাকা ম্যাচ শেষে ২ ঘন্টার মধ্যে পাঠানো হবে।\r\n⭕ 48 প্লেয়ার ম্যাচ হওয়ায় সর্বোচ্চ ৩ ঘন্টা অপেক্ষা করতে হতে পারে।\r\n⭕ ৩ ঘন্টার পরেও টাকা না এলে ম্যাচ হিস্ট্রি সহ স্ক্রিনশট ১০ ঘন্টার মধ্যে সাপোর্টে পাঠাতে হবে।\r\n⭕ মেসেজ করে রেখে দিলেই হবে—যাচাই করে প্রাইজ পাঠানো হবে।\r\n⭕ যেকোনো সমস্যা হলে সাপোর্টে যোগাযোগ করতে হবে।\r\n⭕ FF ROCK এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।'),
(2, 'Clash Squad', 'Match Instructions and Rules\r\n\r\n!CS 4VS4 Normal Solo Entry ম্যাচের নিয়মানলী এবং শর্ত সমূহ :-\r\n\r\n! cs ম্যাচ খেলতে ৪০ লেভেল লাগবে এবং গেম আইডির লেভেল ৫৫ এর নিচে হলে cs প্রত্যেক ম্যাচ শুরু করার আগে স্ক্রিন রেকর্ডিং চালু করে পুরো গেম প্লে ভিডিও আমাদের ফেসবুক পেইজে সাপোর্টে জমা দিতে হবে, ৫৫ লেভেল এর নিচে যাদের তারা cs ম্যাচের ভিডিও না দিলে এপ্স থেকে ব্যান করা হবে!\r\n\r\nএকেক মোডের একেক নিয়ম কানুন তাই একেক মডে একেক রকম খেলতে হবে সমস্ত ম্যাচের নিয়মকানুন মন দিয়ে পড়ুন!\r\n\r\n! CS ম্যাচ খেলতে ৪০ লেভেল লাগবে এবং গেম আইডির লেভেল ৫৫ এর নিচে CS প্রত্যেক ম্যাচ শুরু করার আগে স্ক্রিন রেকর্ডিং চালু করে পুরো গেম প্লে ভিডিও আমাদের ফেসবুক পেইজে সাপোর্টে জমা দিতে হবে, ৫৫ লেভেল এর নিচে যাদের তারা CS ম্যাচের ভিডিও না\r\n\r\nদিলে এপ্স থেকে ব্যান করা হবে! Solo Entry ম্যাচে প্লেয়ারের টিম ১,৩,৫,৭ VS ২,৪,৬,৮ অনুযায়ী হবে।\r\n\r\nCS 4vs4 Normal Match\r\n\r\nম্যাচ কিনার পর ম্যাচের মধ্যে ক্লিক করে একদম নিচের দিকে এসে নিজের কাস্টোমে বসার জায়গাটি দেখে নিবেন কত নাম্বারে আপনি তারপরে কাস্টমার যাওয়ার পর সেই তত নাম্বারে আপনাকে বসতে হবে, CS Custom এ নাম্বার দেওয়া থাকে না, তাই হিসাব করে 12345678 এভাবে সামনে ১-২ গুনে বসবেন, এবং এপ্সে যেভাবে রয়েছে সেভাবে আপনারা বসবেন vs করবেন,\r\n\r\nম্যাচের কাস্টমের আইডি পাসওয়ার্ড নিয়ে Solo Custom এ জয়েন করতে হবে বাধ্যতামূলক, যদি গ্রুপ এন্ট্রি করেন সঙ্গে সঙ্গে কিক আউট করা হবে এবং কোন রিফান্ড দেওয়া হবে না!\r\n\r\nম্যাচের কাস্টমের আইডি পাসওয়ার্ড দেওয়ার পর ম্যাচ শুরু করার সময়ের পর তিন মিনিট অপেক্ষা করা হবে, তিন মিনিট পার হয়ে যাওয়ার পরে কাস্টমের আইডি পাসওয়ার্ড পরিবর্তন করা হবে, এবং হোস্টের হাতে সময় থাকবে আরও তিন মিনিট ম্যাচের প্লেয়ারদের কে নিজেদের জায়গায় বসিয়ে তারপরে শুরু করবে,\r\n\r\nম্যাচ শুরু হওয়ার সময়ের তিন মিনিট পার হওয়ার পরেও যদি কাস্টম কিনেও আপনি কাস্টমে না যান তাহলে আপনি কোন রকমের রিফান্ড পাবেন না!কাস্টমের শুরু হওয়ার সময়ের তিন মিনিট হওয়ার পরেও যদি একজন প্লেয়ার না আসে সে ক্ষেত্রে যে সাইডের প্লেয়ার আসেনি সেই নাম্বার অনুযায়ী অপনেন্টের শেষের প্লেয়ার কে রিফান্ড দেওয়া হবে এবং বাকি প্লেয়ারদের মাঝে 3VS3 করা হবে, দুইজন না আসলে সেমভাবে যে সাইডের প্লেয়ার আসেনি সেই নাম্বার অনুযায়ী অপনেন্টের শেষের দুইজন প্লেয়ার কে রিফান্ড দেওয়া হবে এবং বাকি প্লেয়ারদের মাঝ 2 VS 2 করা হবে, এক পাশের তিন জন প্লেয়ার না আসলে যে সাইডের প্লেয়ার আসেনি সেই নাম্বার অনুযায়ী অপনেন্টের শেষের তিনজন প্লেয়ার কে রিফান্ড দেওয়া হবে এবং বাকি প্লেয়ারদের মাঝে 1VS1 করা হবে,\r\n\r\nCustom হবে cs rank এর মতো, coin 500 থেকে শুরু, যে দল 4 round জিতবে তারা উইনার!\r\n\r\nCustom limited\r\n\r\nCustom এ ক্যারেক্টার স্কিল বন্ধ থাকবে!\r\n\r\nCustom এ Gun gun abilities off/ বন্ধ থাকবে!\r\n\r\nকাস্টমের এর মধ্যে যত কিছু পাবেন সমস্ত কিছু ব্যবহার করতে পারবেন (All Gun boom all allowed)\r\n\r\nকাস্টম শুরু করে দেওয়ার পর যদি কোন প্লেয়ারকে ম্যাচে না ঢুকায় তাহলে ম্যাচব্যাক করে আবারো ম্যাচটি শুরু করা হবে, তাই সবাইকে ব্যাক করে দিতে হবে, যদি কেউ ম্যাচ ব্যাক না করে সেক্ষেত্রে তার জন্য ২ মিনিট অপেক্ষা করা হবে, দুই মিনিট পার হওয়ার পরেও যদি সে না আসে তাহলে তাকে ছাড়াই ম্যাচ শুরু করে দেওয়া হবে, এবং সে কোন রকমে রিফান্ড পাবেনা!\r\n\r\nম্যাচের ভিতর যাওয়ার পর নেটওয়ার্ক সমস্যা করলে সেটার জন্য কর্তৃপক্ষ এবং এনিমি দায়ী নয়! যারা উইন করবে তারা উইনিং প্রাইজ পেয়ে যাবে!\r\n\r\n! ম্যাচে কেউ teaming করে টিমকে হারাতে চাইলে Zone অথবা বোম ব্যবহার করে নিজেকে মারলে ম্যাচের এন্ট্রি ফি অনুযায়ী তাকে জরিমানা করা হবে!\r\n\r\nআপনার FREE FIRE আইডি 40 লেভেলের কম হলে খেলতে পারবেন না। যদি ৪০ লেভেলের কম আইডি দিয়ে রুমে জয়েন করেন রুম থেকে কিক দেওয়া হলে কোন প্রকার REFUND দেওয়া হবে না।হ্যাক বা প্যানেল বা কোন রকমের গ্লিস ব্যবহার করা যাবে না,\r\n\r\n$ ম্যাচ শেষ হওয়ার ৪০ মিনিটের ভিতরে আপনার একাউন্টে টাকা এড করা হবে।\r\n\r\n৪০ মিনিটের ভিতরে একাউন্টে টাকা না পেলে ম্যাচ হিস্ট্রি থেকেসময় দেখা যায় এরকম স্ক্রিনশট নিয়ে আমাদের হোয়াটসঅ্যাপ চ্যানেলে দেওয়া ফেসবুক পেইজে পাঠাতে হবে ১০ ঘণ্টার মধ্যে, মেসেজ করে রাখলে হবে আপনি উইনিং না পেলে আপনাকে উইনিং দিয়ে দেওয়া হবে যেকোনো সময় আপনার মেসেজ দেখার পরেই FF ROCK এর সিদ্ধান্ত চূড়ান্ত সিদ্ধান্ত'),
(3, 'CS 2 VS 2', ''),
(4, 'LONE WOLF', 'Match Instructions and Rules\r\n\r\nLone Wolf 2V2 Match এর নিয়মাবলী এবং শর্তসমূহ:-\r\n\r\nlone wolf ম্যাচ খেলতে ৪০ লেভেল লাগবে এবং গেম আইডির লেভেল ৫৫ এর নিচে lone wolf প্রত্যেক ম্যাচ শুরু করার আগে স্ক্রিন রেকর্ডিং চালু করে পুরো গেম প্লে ভিডিও আমাদের ফেসবুক পেইজে সাপোর্টে জমা দিতে হবে, ৫৫ লেভেল এর নিচে যাদের তারা lone Wolf ম্যাচের ভিডিও না দিলে এপ্স থেকে ব্যান করা হবে!\r\n\r\n! lone Wolf 2v2 solo entry ম্যাচের প্লেয়ার হবে 1,3 VS 2,4 এর মধ্যে খেলা হবে!\r\n\r\n! lone Wolf 2v2 Match solo entry ম্যাচে সমস্ত gun + boom + flash ব্যবহার এবং কিনতে পারবেন, এক কথায় ম্যাচে যা পাবেন সমস্ত কিছু ব্যবহার করতে পারবেন,\r\n\r\n! lone Wolf 2v2 Match solo entry ম্যাচের মধ্যে character skill off and gun attribute off থাকবে,\r\n\r\nম্যাচের কাস্টমের আইডি পাসওয়ার্ড দেওয়ার পর ম্যাচ শুরু করার সময়ের পর তিন মিনিট অপেক্ষা করা হবে, তিন মিনিট পার হয়ে যাওয়ার পরে কাস্টমের আইডি পাসওয়ার্ড পরিবর্তন করা হবে, এবং হোস্টের হাতে সময় থাকবে আরও তিন মিনিট ম্যাচের প্লেয়ারদের কে নিজেদের জায়গায় বসিয়ে তারপরে শুরু করবে,\r\n\r\nম্যাচ শুরু হওয়ার সময়ের তিন মিনিট পার হওয়ার পরেও যদি কাস্টম কিনেও আপনি কাস্টমে না যান তাহলে আপনি কোন রকমের রিফান্ড পাবেন না!\r\n\r\nকাস্টমের শুরু হওয়ার সময়ের তিন মিনিট হওয়ার পরেও যদি একজন প্লেয়ার না আসে সে ক্ষেত্রে যে সাইডের প্লেয়ার আসেনি সেই নাম্বার অনুযায়ী অপনেন্টের শেষের প্লেয়ার কে রিফান্ড দেওয়া হবে এবং বাকি প্লেয়ারদের মাঝে 1VS1 করা হবে,ম্যাচের কাস্টমের আইডি পাসওয়ার্ড নিয়ে Solo Custom এ জয়েন করতে হবে বাধ্যতামূলক, যদি গ্রুপ এন্ট্রি করেন সঙ্গে সঙ্গে কিক আউট করা হবে এবং কোন রিফান্ড দেওয়া হবে না!\r\n\r\nকাস্টম শুরু করে দেওয়ার পর যদি কোন প্লেয়ারকে ম্যাচে না ঢুকায় তাহলে ম্যাচব্যাক করে আবারো ম্যাচটি শুরু করা হবে, তাই সবাইকে ব্যাক করে দিতে হবে, যদি কেউ ম্যাচ ব্যাক না করে সেক্ষেত্রে তার জন্য ২ মিনিট অপেক্ষা করা হবে, দুই মিনিট পার হওয়ার পরেও যদি সে না আসে তাহলে তাকে ছাড়াই ম্যাচ শুরু করে দেওয়া হবে, এবং সে কোন রকমে রিফান্ড পাবেনা!\r\n\r\nহ্যাক বা প্যানেল বা কোন রকমের গ্লিস ব্যবহার করা যাবে না,\r\n\r\nnormal lone wolf এর মত হবে ম্যাচ সমস্ত কিছু লিমিটেড!\r\n\r\nকাস্টমের আইডি পাসওয়ার্ড ২ থেকে ৪ মিনিট আগে দেওয়া হবে, সময়মত কাস্টমে না জয়েন করলে এনিমি কে এন্ট্রি ফি ফেরত দেওয়া হবে,\r\n\r\n* সময় মত কাস্টমে জয়েন না করলে কর্তৃপক্ষ দায়ী না এবং রিফান্ড পাবে না!\r\n\r\nআপনার FREE FIRE আইডি 40 লেভেলের কম হলে খেলতে পারবেন না। যদি ৪০ লেভেলের কম আইডি দিয়ে রুমে জয়েন করেন রুম থেকে কিক দেওয়া হলে কোন প্রকার REFUND দেওয়া হবে না।\r\n\r\nম্যাচের ভিতর নেটওয়ার্ক সমস্যা করলে সেটার জন্য কর্তৃপক্ষ দায়ী নয়!\r\n\r\nম্যাচ শেষ হওয়ার ৪০ মিনিটের ভিতরে আপনার একাউন্টে টাকা এড করা হবে।\r\n\r\n৪০ মিনিটের ভিতরে একাউন্টে টাকা না পেলে ম্যাচ হিস্ট্রি থেকেসময় দেখা যায় এরকম স্ক্রিনশট নিয়ে আমাদের হোয়াটসঅ্যাপ চ্যানেলে দেওয়া ফেসবুক পেইজে পাঠাতে হবে ১০ ঘণ্টার মধ্যে, মেসেজ করে রাখলে হবে আপনি উইনিং না পেলে আপনাকে উইনিং দিয়ে দেওয়া হবে যেকোনো সময় আপনার মেসেজ দেখার পরেই\r\n\r\nFF ROCK  এর সিদ্ধান্ত চূড়ান্ত সিদ্ধান্ত'),
(5, 'FREE MATCH', '🔥সকল ধরনের গাড়ি ব্যবহার করে কিল করতে পারবেন না ❤️\r\n🔥awm and যেকোন স্নাইপার ব্যবহার করা যাবে না ❤️\r\n🎌 গেম ওপেন করার পর থেকে Screen Recording চালু করতে হবে (আবশ্যক) Plane এ ওঠার পর অফ করে দিবেন! ম্যাচ এ আপনার গেমপ্লে সন্দেহজনক হলে আপনার কাছে ভিডিও চাওয়া হবে। ভিডিও না দিলে প্রাইজ পাবেন না। আমরা যদি ৪৮ ঘন্টার মধ্যে ভিডিও না চাই তাইলে ডিলেট করে দিবেন।এতে করে সবার গেমপ্লে ফেয়ার হবে।\r\n৩০০ টাকার বেশি কেউ withdraw দিবেন না।\r\nBR MATCH এ M82B Gun ব্যবহার করলে তাকে Prize Money দেয়া হবে না। মনে রাখবেন 😊❤️\r\n⚠️ (Female character) নিয়ে খেলা যাবে না।\r\n⚠️কোন PC প্লেয়ার গ্রহণযোগ্য নয়\r\n⚠️Full Map & Heal BattleBattle করলে কোনো রিওয়ার্ড পাবেন না।\r\n⚠️কোন কারন বসত রুম থেকে কিক মারলে Recording ছাড়া টাকা Refund পাবেন না।\r\n⚠️ আপনার ফ্রি ফায়ার আইডি মিনিমাম 40 লেভেল হতে হবে।\r\n⚠️ রুম আইডি পাসওয়াড ৫ মিনিট আগে দেওয়া হবে।\r\n⚠️ হ্যাক/টিমিং করলে এপ থেকে আপনার আইডি ব্যান করা হবে\r\n⚠️ বাহিরের (Unregistered) প্লেয়ার আ্যড দেওয়া যাবে না।\r\n⚠️ প্রতি মেচ শেষে ২০-৩০ মিনিটের মধ্যে Winnings দেওয়া হবে।\r\n⚠️ যদি ম্যাচটি কোন কারণে বাতিল হয়ে যায় তাহলে ব্যবহারকারী 1 ঘন্টার মধ্যে তার টাকা রিফান্ড পাবে।\r\n⚠️Game এ যেই নাম আছে সেটা দিয়ে ম্যাচ এ জইন দিবেন। কেও UID দিবেন না।\r\n⚠️সঠিক সময়ে মেচ এ জইন করতে না পারলে টাকা ফিরত দেওয়া হবে না।\r\n⚠️WITHDRAW প্রতিদিন রাত ১২:০০ টার সময় দেওয়া হয়।\r\n☢️এডমিন এর যেকোনো সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত'),
(6, 'Ludo', '⛔ ম্যাচ শেষ হওয়ার সাথে Win এর স্ক্রিনশট WhatsApp দিবেন!!!!!!! \r\n\r\n🔁 লুডু খেলতে Ludu King অ্যাপটি ডাউনলোড করুন। \r\n🔁লুডু কিং অ্যাপে আপনার যে নাম আছে সেই নামটি রেজিষ্ট্রেশন করার সময় বসাবেন।\r\n🔁কোন প্লেয়ার ম্যাচে না আসলে তার এন্ট্রি ফ্রি থেকে রুম চার্জ রেখে বাকি টাকা রিটার্ন করা হবে।আর যে প্লেয়ার আসবে সে প্লেয়ার এর সম্পূর্ণ এন্ট্রি ফ্রি টাকা রিটার্ন  দেওয়া হবে।\r\n🔁 ম্যাচ শেষে অবশ্যই WhatsApp  ম্যাচ Win এর স্কিনশট দিবেন।\r\n🔁প্রতিদিনের ম্যাচের টাকা প্রতিদিন বুঝে নিবেন।\r\n🔁FF ROCK এর সিদ্ধান্ত চূড়ান্ত সিদ্ধান্ত ⚠️');

-- --------------------------------------------------------

--
-- Table structure for table `aerox_sliders`
--

CREATE TABLE `aerox_sliders` (
  `id` int(11) NOT NULL,
  `img` varchar(255) DEFAULT NULL,
  `link` varchar(255) DEFAULT '#'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_sliders`
--

INSERT INTO `aerox_sliders` (`id`, `img`, `link`) VALUES
(2, 'https://i.postimg.cc/d3PBpDHD/WBTft-Yp-XRj-M-SD.jpg', '#'),
(3, 'https://i.ytimg.com/vi/ivZ5UP0bAic/maxresdefault.jpg', 'https://discord.gg/R2zbBjAW9V'),
(23, 'https://i.ibb.co.com/3y6GZbPc/20251115-000808.jpg', '#'),
(25, 'https://admin.hhhesports.com/uploads/05112025184028943.jpg', '#'),
(26, 'https://admin.hhhesports.com/uploads/0511202518394121.jpg', '#'),
(27, 'https://admin.hhhesports.com/uploads/05112025183751689.jpg', '#');

-- --------------------------------------------------------

--
-- Table structure for table `aerox_users`
--

CREATE TABLE `aerox_users` (
  `id` int(11) NOT NULL,
  `Name` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `Number` varchar(20) NOT NULL,
  `Password` varchar(255) NOT NULL,
  `Balance` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Winning` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Total_Kill` int(11) NOT NULL DEFAULT 0,
  `Total_Winning` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Total_Played` int(11) NOT NULL DEFAULT 0,
  `UsersBan` varchar(10) DEFAULT 'False',
  `FCM_Token` text DEFAULT NULL,
  `Register` datetime DEFAULT current_timestamp(),
  `is_developer` tinyint(1) NOT NULL DEFAULT 0,
  `is_admin` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_users`
--

INSERT INTO `aerox_users` (`id`, `Name`, `email`, `Number`, `Password`, `Balance`, `Winning`, `Total_Kill`, `Total_Winning`, `Total_Played`, `UsersBan`, `FCM_Token`, `Register`, `is_developer`, `is_admin`) VALUES
(3555, 'admin', NULL, 'admin', '$2y$12$l4oIIUMVRtKYCnxKnOxBk.L8aqX6LIryDPePEeW6Sopp0IjRVE.zO', 0.00, 0.00, 0, 0.00, 3, 'False', 'fgBep3cils1Q15Jb_ZPlDG:APA91bEdoKG3Y0iTIPXyCGp-yDcpj4UAFnWrECThHSb5a_W58x-cda65JnBAH6uPoU0HVLiASaNH1nCMLcNHKNIg4yehomY9vxaKh8fxLxMOWLa5JBEhLo4', '2025-07-24 02:13:45', 0, 0),
(3567, 'Riday12', NULL, '01993532170', '$2y$12$/JrUSMETBNy7TNPJvzn5A.Nmf0hGr3yVgVfFlnNgU/yI6EkQQKoA2', 0.00, 0.00, 0, 0.00, 0, 'True', NULL, '2025-11-10 00:53:20', 0, 0),
(3568, 'MD. ALFI SHAHOR', NULL, '01719220456', '$2y$12$Nlot5ermX6l5CBl37HoUyeRlD51/tQSUMVVrz9rK8rgS7lxCEoZwW', 0.00, 0.00, 0, 0.00, 8, 'False', 'fgBep3cils1Q15Jb_ZPlDG:APA91bEdoKG3Y0iTIPXyCGp-yDcpj4UAFnWrECThHSb5a_W58x-cda65JnBAH6uPoU0HVLiASaNH1nCMLcNHKNIg4yehomY9vxaKh8fxLxMOWLa5JBEhLo4', '2025-11-10 01:46:21', 1, 0),
(3569, 'ARASH', NULL, '01834708355', '$2y$12$O4nXBqurJUwj.dTO7vs3FepIlwVwQnuh0FKfqDaSWySwgw/oE06a2', 0.00, 0.00, 0, 0.00, 0, 'False', NULL, '2025-11-10 02:49:50', 0, 0),
(3570, 'sumonvibot', NULL, '01618586841', '$2y$12$5zgQJIP4/GL.sU.b6LGmHe8NHqdNYsW/DZZ8Fsx82fa256ZcO1Nfe', 0.00, 0.00, 0, 0.00, 3, 'False', 'fiEh8rY1pmW78Rqx2FdEBt:APA91bGA_awXztImjkhX-ael9iBz_RC7e45WedZjPki7am94-yVkH8tb8GXDMtAl5ncA_OmmyonecIBF-aQ3SzDozP8nVHWl-rD9-JMuYFJ9Wuv5Jkb3J88', '2025-11-10 10:07:01', 0, 0),
(3571, 'Shawon', NULL, '01912667798', '$2y$12$5jE23UHQpQrIwN29fAofS.U0mOiXPjuqWWwiQUWrYNKlPipAr7gTi', 0.00, 0.00, 0, 0.00, 1, 'False', NULL, '2025-11-10 10:30:42', 0, 1),
(3572, 'Riday123', NULL, '01602647727', '$2y$12$7HikCGugF3NYwUOI.VldU.S/4jVY4WBsm3zGqTWf65EPdWRNib6wK', 0.00, 0.00, 0, 0.00, 1, 'False', NULL, '2025-11-10 11:59:22', 0, 0),
(3574, 'Akash', NULL, '01990160813', '$2y$12$tiCFIuHd6l.5e1/Nm/wPguHA.a.Xh3jQFpXl/KoGmgmkF/ssPJkqm', 0.00, 0.00, 0, 0.00, 1, 'False', NULL, '2025-11-11 17:47:52', 0, 0),
(3575, 'sharafat', NULL, '01943367577', '$2y$12$JLkzBplzAWI7PNxPeXdXh.W.Z0FdG3FbS1j2.V.PvKeYG3pnudhvS', 0.00, 0.00, 0, 0.00, 3, 'False', NULL, '2025-11-11 19:53:18', 0, 0),
(3576, 'Sohan', NULL, '01962503337', '$2y$12$mfrrlmsyGA6U/7j8NRHGAeRnHKDuEoP7oYdcLvMqeqJNxuHEjRo4y', 0.00, 0.00, 0, 0.00, 1, 'False', NULL, '2025-11-13 21:42:56', 0, 0),
(3577, 'T.L᭄』☞কদমা-2', NULL, '01858862992', '$2y$12$BbFZ3kJ9b2pk7Y/fgH2x8OW5FZ4VPeIljJgIOfoTzF2ygF2DpAnIK', 0.00, 0.00, 0, 0.00, 1, 'False', NULL, '2025-11-13 22:29:48', 0, 0),
(3578, 'Nahid islam', NULL, '01854384930', '$2y$12$mi.QLla4Xfwd7bnEMy7ofOZUr8Na/n4AfcFLnOTyEzDfkxUdV7xku', 0.00, 0.00, 0, 0.00, 0, 'False', NULL, '2025-11-13 22:37:34', 0, 0),
(3579, 'ᴛʟ≠ʟᴜғғʏルフィ', NULL, '01314544029', '$2y$12$aiTh.8K176WXCnY4twBbcetCRitTeYks0F6imVO8JRATbEySWipX6', 0.00, 0.00, 0, 0.00, 1, 'False', NULL, '2025-11-14 00:59:37', 0, 0),
(3580, 'Munna', NULL, '01740776278', '$2y$12$A1s5p0jVcbozIwSV6mw/OuBV.sncDLos6X4.QEVcQMAzN341ZgKNG', 0.00, 0.00, 0, 0.00, 0, 'False', NULL, '2025-11-14 10:11:00', 0, 0),
(3581, 'Mahin', NULL, '01932991874', '$2y$12$7kaupiiAmSpoilcDBviM5OAibJkow0SxZkHFjvYlUJQciNymAclk6', 0.00, 0.00, 0, 0.00, 1, 'False', NULL, '2025-11-14 22:56:53', 0, 0),
(3584, 'Zoro', NULL, '01609595636', '$2y$12$MI8pyZQX.KGVVa5a2/u.5ui3fH0WmWcIcpbUvrOXKYB3v7FED4LD.', 0.00, 0.00, 0, 0.00, 1, 'False', NULL, '2025-11-16 00:57:08', 0, 0),
(3585, 'Afzal Islam', NULL, '01981828355', '$2y$12$N4dcdj07LvGikO14EOFtJ.4lGUtXaYDGmuEvZ09OBwEtT0BzDmVEa', 0.00, 0.00, 0, 0.00, 0, 'False', NULL, '2025-11-17 20:17:29', 0, 0),
(3586, 'Afzal Islam', NULL, '01851277799', '$2y$12$4GnhoBSe4W7eQKUK51dJ..dHiBijwIIe3B0O0ixyJYz81PsQhq6H2', 0.00, 0.00, 0, 0.00, 1, 'False', NULL, '2025-11-17 22:25:54', 0, 0),
(3587, 'md shawon', NULL, '01710055163', '$2y$12$HiAEGqOBgbhUXzM6yb/KN.54Jv354vfhGFou5j8AXMCc8S/vEMuqm', 0.00, 100.00, 0, 0.00, 0, 'False', NULL, '2025-11-17 23:27:33', 0, 1),
(3588, 'MD AKASH', NULL, '01799925886', '$2y$12$aasfdUT.Zjd8tMlwyP0FUufHcB1KeQ6uwRSa3azpU5snNp3DvWvEe', 0.00, 0.00, 0, 0.00, 0, 'False', NULL, '2025-11-20 14:13:29', 0, 0),
(3589, 'MD AKASH', NULL, '01799925884', '$2y$12$MOnCY8o8TJokOEBNOKihOOltU7ra1y0UyaSqNhyICHCSXSDVhgRt6', 0.00, 0.00, 0, 0.00, 0, 'False', NULL, '2025-11-20 14:13:52', 0, 0),
(3590, 'MD AKASH1', NULL, '01715596446', '$2y$12$XZBn35sJKfxh9IgRo68/Pe8T4WjIs33Jdo4FCNWjqAWvvNq1Mcz82', 0.00, 0.00, 0, 0.00, 0, 'False', NULL, '2025-11-20 14:14:55', 0, 0),
(3591, 'asif', NULL, '01816619551', '$2y$12$0pR7vIbnogqpyrVoqzm71uQa6KHbKwVLk8nyQU6XhXN8eoAYi41vC', 0.00, 0.00, 0, 0.00, 0, 'True', NULL, '2025-11-20 14:22:09', 0, 0),
(3592, 'FF KING', NULL, '01926637011', '$2y$12$4Ur.xnOUfW0/4C93m/Y3teuZAkm4X9uE3WEH3lvnvrWRitit3f2km', 0.00, 0.00, 0, 0.00, 0, 'False', NULL, '2025-11-20 19:13:49', 0, 0),
(3594, 'MD Humayun Ahmed', NULL, '01768802953', '$2y$12$MjVqMOIUnvjd/7L.EtfkJuezKpvMCU6irWWSUkMoc3.fNfPQLij16', 78234.00, 0.00, 0, 0.00, 7, 'False', 'etG97JBNqAGzKHz9lXE2e9:APA91bGEvsUDtqhtOjIlCreeEdTMmFJKFbZO4Z4L06-oM_sD2Ny2pJ01qxR1HXdJDeOke8WlQIxxjGu0_WJahKx9LcHLUW3fnWcV-XoyE0Wgs8E1Ql5qT4M', '2025-12-10 15:51:13', 0, 0),
(3595, 'MD Humayun Ahmed', NULL, '01723456789', '$2y$12$xv7QC6/7MtB.YnH2R6GvS.uFeMivVVPzmg4CaZBNbqIE2k8QH2xJ6', 0.00, 0.00, 0, 0.00, 0, 'False', NULL, '2026-01-05 17:30:27', 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `aerox_withdraw`
--

CREATE TABLE `aerox_withdraw` (
  `id` int(11) NOT NULL,
  `Name` varchar(255) DEFAULT NULL,
  `Number` varchar(20) DEFAULT NULL,
  `Method` varchar(50) DEFAULT NULL,
  `Amount` decimal(10,2) NOT NULL DEFAULT 0.00,
  `Payment` varchar(255) DEFAULT NULL,
  `Date` datetime DEFAULT NULL,
  `Status` enum('Pending','Complete','Failed') DEFAULT 'Pending'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `aerox_withdraw`
--

INSERT INTO `aerox_withdraw` (`id`, `Name`, `Number`, `Method`, `Amount`, `Payment`, `Date`, `Status`) VALUES
(9, 'Trail Package', '01719226480', 'bKash', 100.00, '01966154606', '2025-11-09 23:39:12', 'Complete'),
(10, 'MD. ALFI SHAHOR', '01719220456', 'bKash', 185.00, '01966154606', '2025-11-13 13:16:39', 'Failed'),
(11, 'MD. ALFI SHAHOR', '01719220456', 'Nagad', 150.00, '01966154606', '2025-11-13 13:37:41', 'Failed'),
(12, 'MD. ALFI SHAHOR', '01719220456', 'bKash', 800.00, '01966154606', '2025-11-13 20:22:34', 'Failed'),
(13, 'md shawon', '01710055163', 'Rocket', 100.00, '01912667798', '2025-11-17 23:30:44', 'Failed'),
(14, 'md shawon', '01710055163', 'bKash', 70.00, '01912667798', '2025-11-20 23:00:15', 'Failed'),
(15, 'MD Humayun Ahmed', '01768802953', 'bKash', 1000.00, '0896785657', '2025-12-10 16:35:30', 'Complete'),
(16, 'MD Humayun Ahmed', '01768802953', 'bKash', 14000.00, '0896785657', '2025-12-10 16:48:24', 'Complete'),
(17, 'MD Humayun Ahmed', '01768802953', 'bKash', 500.00, '0896785657', '2025-12-10 22:53:44', 'Failed'),
(18, 'MD Humayun Ahmed', '01768802953', 'bKash', 500.00, '-+666665555', '2025-12-10 23:15:37', 'Complete');

-- --------------------------------------------------------

--
-- Table structure for table `pending_payments`
--

CREATE TABLE `pending_payments` (
  `id` int(11) NOT NULL,
  `trx_id` varchar(255) NOT NULL,
  `amount` decimal(10,2) NOT NULL,
  `method` varchar(50) NOT NULL,
  `received_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `pending_payments`
--

INSERT INTO `pending_payments` (`id`, `trx_id`, `amount`, `method`, `received_at`) VALUES
(16, '74HEU83T', 1500.00, 'Unknown', '2025-11-20 21:37:07');

-- --------------------------------------------------------

--
-- Table structure for table `popup_notifications`
--

CREATE TABLE `popup_notifications` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL DEFAULT 'Important Notice',
  `content` longtext DEFAULT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `popup_notifications`
--

INSERT INTO `popup_notifications` (`id`, `title`, `content`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'Welcome!', 'This is a test popup message 🎉', 1, '2025-11-11 04:04:08', '2025-11-11 04:04:08');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `aerox_addmoney`
--
ALTER TABLE `aerox_addmoney`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_payment_status` (`Payment`,`Status`),
  ADD KEY `idx_user_number` (`Number`);

--
-- Indexes for table `aerox_admin`
--
ALTER TABLE `aerox_admin`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `aerox_freefire`
--
ALTER TABLE `aerox_freefire`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_match_key_ff` (`Match_Key`);

--
-- Indexes for table `aerox_joining`
--
ALTER TABLE `aerox_joining`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_match_user_joining` (`Match_Key`,`Number`);

--
-- Indexes for table `aerox_ludo`
--
ALTER TABLE `aerox_ludo`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_match_key_ludo` (`Match_Key`);

--
-- Indexes for table `aerox_notice`
--
ALTER TABLE `aerox_notice`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `aerox_password`
--
ALTER TABLE `aerox_password`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- Indexes for table `aerox_pubg`
--
ALTER TABLE `aerox_pubg`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `Match_Key` (`Match_Key`);

--
-- Indexes for table `aerox_pubg_joining`
--
ALTER TABLE `aerox_pubg_joining`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `aerox_results`
--
ALTER TABLE `aerox_results`
  ADD PRIMARY KEY (`id`),
  ADD KEY `match_key` (`match_key`);

--
-- Indexes for table `aerox_rules`
--
ALTER TABLE `aerox_rules`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `match_category` (`match_category`);

--
-- Indexes for table `aerox_sliders`
--
ALTER TABLE `aerox_sliders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `aerox_users`
--
ALTER TABLE `aerox_users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `Number` (`Number`);

--
-- Indexes for table `aerox_withdraw`
--
ALTER TABLE `aerox_withdraw`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_user_number_withdraw` (`Number`);

--
-- Indexes for table `pending_payments`
--
ALTER TABLE `pending_payments`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `trx_id` (`trx_id`);

--
-- Indexes for table `popup_notifications`
--
ALTER TABLE `popup_notifications`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `aerox_addmoney`
--
ALTER TABLE `aerox_addmoney`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;

--
-- AUTO_INCREMENT for table `aerox_admin`
--
ALTER TABLE `aerox_admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `aerox_freefire`
--
ALTER TABLE `aerox_freefire`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;

--
-- AUTO_INCREMENT for table `aerox_joining`
--
ALTER TABLE `aerox_joining`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;

--
-- AUTO_INCREMENT for table `aerox_ludo`
--
ALTER TABLE `aerox_ludo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `aerox_notice`
--
ALTER TABLE `aerox_notice`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `aerox_password`
--
ALTER TABLE `aerox_password`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `aerox_pubg`
--
ALTER TABLE `aerox_pubg`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `aerox_pubg_joining`
--
ALTER TABLE `aerox_pubg_joining`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `aerox_results`
--
ALTER TABLE `aerox_results`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `aerox_rules`
--
ALTER TABLE `aerox_rules`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `aerox_sliders`
--
ALTER TABLE `aerox_sliders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `aerox_users`
--
ALTER TABLE `aerox_users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3596;

--
-- AUTO_INCREMENT for table `aerox_withdraw`
--
ALTER TABLE `aerox_withdraw`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `pending_payments`
--
ALTER TABLE `pending_payments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `popup_notifications`
--
ALTER TABLE `popup_notifications`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
